{"weightsManifest": [{"paths": ["group1-shard1of138.bin", "group1-shard2of138.bin", "group1-shard3of138.bin", "group1-shard4of138.bin", "group1-shard5of138.bin", "group1-shard6of138.bin", "group1-shard7of138.bin", "group1-shard8of138.bin", "group1-shard9of138.bin", "group1-shard10of138.bin", "group1-shard11of138.bin", "group1-shard12of138.bin", "group1-shard13of138.bin", "group1-shard14of138.bin", "group1-shard15of138.bin", "group1-shard16of138.bin", "group1-shard17of138.bin", "group1-shard18of138.bin", "group1-shard19of138.bin", "group1-shard20of138.bin", "group1-shard21of138.bin", "group1-shard22of138.bin", "group1-shard23of138.bin", "group1-shard24of138.bin", "group1-shard25of138.bin", "group1-shard26of138.bin", "group1-shard27of138.bin", "group1-shard28of138.bin", "group1-shard29of138.bin", "group1-shard30of138.bin", "group1-shard31of138.bin", "group1-shard32of138.bin", "group1-shard33of138.bin", "group1-shard34of138.bin", "group1-shard35of138.bin", "group1-shard36of138.bin", "group1-shard37of138.bin", "group1-shard38of138.bin", "group1-shard39of138.bin", "group1-shard40of138.bin", "group1-shard41of138.bin", "group1-shard42of138.bin", "group1-shard43of138.bin", "group1-shard44of138.bin", "group1-shard45of138.bin", "group1-shard46of138.bin", "group1-shard47of138.bin", "group1-shard48of138.bin", "group1-shard49of138.bin", "group1-shard50of138.bin", "group1-shard51of138.bin", "group1-shard52of138.bin", "group1-shard53of138.bin", "group1-shard54of138.bin", "group1-shard55of138.bin", "group1-shard56of138.bin", "group1-shard57of138.bin", "group1-shard58of138.bin", "group1-shard59of138.bin", "group1-shard60of138.bin", "group1-shard61of138.bin", "group1-shard62of138.bin", "group1-shard63of138.bin", "group1-shard64of138.bin", "group1-shard65of138.bin", "group1-shard66of138.bin", "group1-shard67of138.bin", "group1-shard68of138.bin", "group1-shard69of138.bin", "group1-shard70of138.bin", "group1-shard71of138.bin", "group1-shard72of138.bin", "group1-shard73of138.bin", "group1-shard74of138.bin", "group1-shard75of138.bin", "group1-shard76of138.bin", "group1-shard77of138.bin", "group1-shard78of138.bin", "group1-shard79of138.bin", "group1-shard80of138.bin", "group1-shard81of138.bin", "group1-shard82of138.bin", "group1-shard83of138.bin", "group1-shard84of138.bin", "group1-shard85of138.bin", "group1-shard86of138.bin", "group1-shard87of138.bin", "group1-shard88of138.bin", "group1-shard89of138.bin", "group1-shard90of138.bin", "group1-shard91of138.bin", "group1-shard92of138.bin", "group1-shard93of138.bin", "group1-shard94of138.bin", "group1-shard95of138.bin", "group1-shard96of138.bin", "group1-shard97of138.bin", "group1-shard98of138.bin", "group1-shard99of138.bin", "group1-shard100of138.bin", "group1-shard101of138.bin", "group1-shard102of138.bin", "group1-shard103of138.bin", "group1-shard104of138.bin", "group1-shard105of138.bin", "group1-shard106of138.bin", "group1-shard107of138.bin", "group1-shard108of138.bin", "group1-shard109of138.bin", "group1-shard110of138.bin", "group1-shard111of138.bin", "group1-shard112of138.bin", "group1-shard113of138.bin", "group1-shard114of138.bin", "group1-shard115of138.bin", "group1-shard116of138.bin", "group1-shard117of138.bin", "group1-shard118of138.bin", "group1-shard119of138.bin", "group1-shard120of138.bin", "group1-shard121of138.bin", "group1-shard122of138.bin", "group1-shard123of138.bin", "group1-shard124of138.bin", "group1-shard125of138.bin", "group1-shard126of138.bin", "group1-shard127of138.bin", "group1-shard128of138.bin", "group1-shard129of138.bin", "group1-shard130of138.bin", "group1-shard131of138.bin", "group1-shard132of138.bin", "group1-shard133of138.bin", "group1-shard134of138.bin", "group1-shard135of138.bin", "group1-shard136of138.bin", "group1-shard137of138.bin", "group1-shard138of138.bin"], "weights": [{"dtype": "float32", "shape": [3, 3, 3, 64], "name": "block1_conv1/kernel", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.004713413060880175, "min": -0.6504510024014641}}, {"dtype": "float32", "shape": [64], "name": "block1_conv1/bias", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.006919113356693118, "min": -0.013838226713386236}}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "block1_conv2/kernel", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.0017944358727511238, "min": -0.21353786885738374}}, {"dtype": "float32", "shape": [64], "name": "block1_conv2/bias", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.006805431375316545, "min": -0.9595658239196329}}, {"dtype": "float32", "shape": [3, 3, 64, 128], "name": "block2_conv1/kernel", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.002977440871444403, "min": -0.3364508184732175}}, {"dtype": "float32", "shape": [128], "name": "block2_conv1/bias", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.002046426955391379, "min": -0.16985343729748445}}, {"dtype": "float32", "shape": [3, 3, 128, 128], "name": "block2_conv2/kernel", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.0016900494402530147, "min": -0.18759548786808464}}, {"dtype": "float32", "shape": [128], "name": "block2_conv2/bias", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.004494813610525692, "min": -0.5348828196525574}}, {"dtype": "float32", "shape": [3, 3, 128, 256], "name": "block3_conv1/kernel", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.003007548696854535, "min": -0.1714302757207085}}, {"dtype": "float32", "shape": [256], "name": "block3_conv1/bias", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.0015797854054207896, "min": -0.17377639459628685}}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "block3_conv2/kernel", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.0027369221051534018, "min": -0.1450568715731303}}, {"dtype": "float32", "shape": [256], "name": "block3_conv2/bias", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.0016978535582037532, "min": -0.1595982344711528}}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "block3_conv3/kernel", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.0011888442962777381, "min": -0.08559678933199714}}, {"dtype": "float32", "shape": [256], "name": "block3_conv3/bias", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.001797278576037463, "min": -0.11322855029036016}}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "block3_conv4/kernel", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.0013224616938946293, "min": -0.0991846270420972}}, {"dtype": "float32", "shape": [256], "name": "block3_conv4/bias", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.0013401166773309894, "min": -0.09112793405850728}}, {"dtype": "float32", "shape": [3, 3, 256, 512], "name": "block4_conv1/kernel", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.0014348510725825442, "min": -0.1104835325888559}}, {"dtype": "float32", "shape": [512], "name": "block4_conv1/bias", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.0004595814966687969, "min": -0.03538777524349736}}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block4_conv2/kernel", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.0019685134583828498, "min": -0.11220526712782243}}, {"dtype": "float32", "shape": [512], "name": "block4_conv2/bias", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.0006582752892784043, "min": -0.056611674877942775}}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block4_conv3/kernel", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.001523033427257164, "min": -0.09138200563542984}}, {"dtype": "float32", "shape": [512], "name": "block4_conv3/bias", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.0006330082813898722, "min": -0.07216294407844544}}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block4_conv4/kernel", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.0014028952986586327, "min": -0.13608084396988737}}, {"dtype": "float32", "shape": [512], "name": "block4_conv4/bias", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.001173653614287283, "min": -0.11149709335729188}}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block5_conv1/kernel", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.001797486549498988, "min": -0.11863411226693321}}, {"dtype": "float32", "shape": [512], "name": "block5_conv1/bias", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.0017509167100868974, "min": -0.1348205866766911}}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block5_conv2/kernel", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.0018349884479653602, "min": -0.11376928377385233}}, {"dtype": "float32", "shape": [512], "name": "block5_conv2/bias", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.0029383946867550122, "min": -0.2850242846152362}}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block5_conv3/kernel", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.0015210261239725, "min": -0.124724142165745}}, {"dtype": "float32", "shape": [512], "name": "block5_conv3/bias", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.009505366811565325, "min": -1.4162996549232334}}, {"dtype": "float32", "shape": [3, 3, 512, 512], "name": "block5_conv4/kernel", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.0011175481127757652, "min": -0.11398990750312805}}, {"dtype": "float32", "shape": [512], "name": "block5_conv4/bias", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.03959601860420377, "min": -0.4751522232504452}}, {"dtype": "float32", "shape": [25088, 4096], "name": "fc1/kernel", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.00018729438238284166, "min": -0.022475325885941}}, {"dtype": "float32", "shape": [4096], "name": "fc1/bias", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.006047672150181789, "min": -0.7499113466225419}}, {"dtype": "float32", "shape": [4096, 4096], "name": "fc2/kernel", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.00024752123098747405, "min": -0.02202938955788519}}, {"dtype": "float32", "shape": [4096], "name": "fc2/bias", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.004836881321434881, "min": -0.014510643964304643}}, {"dtype": "float32", "shape": [4096, 1000], "name": "predictions/kernel", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.00036253468955264374, "min": -0.037341073023922304}}, {"dtype": "float32", "shape": [1000], "name": "predictions/bias", "quantization": {"dtype": "uint8", "original_dtype": "float32", "scale": 0.005734999974568685, "min": -0.7742249965667725}}]}], "modelTopology": {"keras_version": "2.2.4-tf", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"ragged": false, "dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block1_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block1_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block1_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block1_conv2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"name": "block1_pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block1_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block2_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block2_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block2_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block2_conv2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"name": "block2_pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block2_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block3_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block3_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block3_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block3_conv2"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block3_conv3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block3_conv3"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block3_conv4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block3_conv4"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv4", 0, 0, {}]]], "config": {"name": "block3_pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block3_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block4_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block4_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block4_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block4_conv2"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block4_conv3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block4_conv3"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block4_conv4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block4_conv4"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv4", 0, 0, {}]]], "config": {"name": "block4_pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block4_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block5_conv1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block5_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block5_conv2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block5_conv2"}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block5_conv3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block5_conv3"}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "block5_conv4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block5_conv4"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv4", 0, 0, {}]]], "config": {"name": "block5_pool", "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2]}, "name": "block5_pool"}, {"class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "flatten", "data_format": "channels_last"}, "name": "flatten"}, {"class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fc1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 4096, "use_bias": true, "activity_regularizer": null}, "name": "fc1"}, {"class_name": "Dense", "inbound_nodes": [[["fc1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "fc2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 4096, "use_bias": true, "activity_regularizer": null}, "name": "fc2"}, {"class_name": "Dense", "inbound_nodes": [[["fc2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "predictions", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1000, "use_bias": true, "activity_regularizer": null}, "name": "predictions"}], "input_layers": [["input_1", 0, 0]], "name": "vgg19", "output_layers": [["predictions", 0, 0]]}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v2.7.0", "format": "layers-model"}
